* DONE Guido's Gogeous Lasagna [5/5]
:LOGBOOK:
CLOSED: [2022-05-29 Sun 16:55]
CLOCK: [2022-05-27 Fri 11:50]--[2022-05-27 Fri 12:05] =>  0:15
:END:
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2022-05-29 Sun 16:56]
| Headline                      | Time   |
|-------------------------------+--------|
| *Total time*                  | *0:15* |
|-------------------------------+--------|
| Guido's Gogeous Lasagna [5/5] | 0:15   |
#+END:

- [X] define the 'EXPECTED_BAKE_TIME' constant
- [X] consider defining the 'PREPARATION_TIME' constant
  equal to the time it takes to prepare a single layer
- [X] define the 'bake_time_remaining()' function
- [X] define the 'preparation_time_in_minutes()' function and consider
  using 'PREPARATION_TIME' here
- [X] define the 'elapsed_time_in_minutes()' function
